* Recurrent Neural Networks for Time Series: Sunspots
:PROPERTIES:
:header-args: :session R-session :results output value table :colnames yes
:END:

#+NAME: round-tbl
#+BEGIN_SRC emacs-lisp :var tbl="" fmt="%.1f"
(mapcar (lambda (row)
          (mapcar (lambda (cell)
                    (if (numberp cell)
                        (format fmt cell)
                      cell))
                  row))
        tbl)
#+end_src

#+RESULTS: round-tbl


#+BEGIN_SRC R :post round-tbl[:colnames yes](*this*)
library(tidyverse)
library(magrittr)
library(glue)
library(forcats)
library(lubridate)

# time series 
library(timetk)
library(tidyquant)
library(tibbletime)

# visualization 
library(cowplot)

# preprocessing
library(recipes)

# sampling / accuracy 
library(rsample)
library(yardstick)

# modeling
library(keras)
library(tfruns)
#+END_SRC

#+RESULTS:
| x                    |
|----------------------|
| tfruns               |
| keras                |
| yardstick            |
| rsample              |
| cowplot              |
| tibbletime           |
| tidyquant            |
| quantmod             |
| TTR                  |
| PerformanceAnalytics |
| xts                  |
| zoo                  |
| timetk               |
| recipes              |
| lubridate            |
| glue                 |
| magrittr             |
| forcats              |
| stringr              |
| dplyr                |
| purrr                |
| readr                |
| tidyr                |
| tibble               |
| ggplot2              |
| tidyverse            |
| stats                |
| graphics             |
| grDevices            |
| utils                |
| datasets             |
| methods              |
| base                 |

** Data

Our dataset is a ts class (not tidy), so we need to convert it to a tidy data set first using the tk_tbl function. 

#+BEGIN_SRC R :post round-tbl[:colnames yes](*this*)
sun_spots <- datasets::sunspot.month %>%
    tk_tbl() %>%
    mutate(index = as_date(index)) %>%
    as_tbl_time(index = index)

sun_spots %>%
    head()
#+END_SRC

#+RESULTS:
|      index | value |
|------------+-------|
| 1749-01-01 |  58.0 |
| 1749-02-01 |  62.6 |
| 1749-03-01 |  70.0 |
| 1749-04-01 |  55.7 |
| 1749-05-01 |  85.0 |
| 1749-06-01 |  83.5 |

